OpenFOAM/freeSurfaceFlows-0F4.1/cases/spillway-2.2/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-20 -0.45 0 )
    ( 15 -0.45 0 )
    ( 15 -0.45 6 )
    ( 15 -0.45 8 )
    (-20 -0.45 8 )
    (-20 -0.45 6 )
    (-20 -0.55 0 )
    ( 15 -0.55 0 )
    ( 15 -0.55 6 )
    ( 15 -0.55 8 )
    (-20 -0.55 8 )
    (-20 -0.55 6 )
);

blocks
(
    hex (0 1 2 5 6 7 8 11) (70 12 1) simpleGrading (1 1 1)
    hex (5 2 3 4 11 8 9 10) (70 4 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inletAir
    {
        type patch;
        faces
        (
            (4 5 11 10)
        );
    }
    
    inletWater
    {
        type patch;
        faces
        (
            (5 0 6 11)
        );
    }
    
    outlet
    {
        type patch;
        faces
        (
            (1 2 8 7)
            (2 3 9 8)
        );
    }
    
    atmosphere
    {
        type patch;
        faces
        (
            (3 4 10 9)
        );
    }
    
    bottomWall
    {
        type wall;
        faces
        (
            (0 1 7 6)
        );
    }
    
    front
    {
        type empty;
        faces
        (
            (1 0 5 2)
            (2 5 4 3)
        );
    }
    
    back
    {
        type empty;
        faces
        (
            (6 7 8 11)
            (11 8 9 10)
        );
    }
    
);

mergePatchPairs
(
);

// ************************************************************************* //
